improving plan with better docs
